// 1. Знайти суму всіх цілих чисел від 1 до 15
let sum3 = 0;
let b = 1;
do {
    sum3 += b;
    b++;
} while (b<=15);
console.log('Cума всіх цілих чисел від 1 до 15 =', sum3);

// 2. Знайти добуток усіх цілих чисел від 15 до 35
let product2 = 1;
let d = 15;
while (d<=35) {
    product2*=d;
    d++;
}
console.log('Добуток всіх цілих чисел від 15 до 35 =', product2)

// 3. Знайти середнє арифметичне всіх цілих чисел від 1 до 500
let sum = 0;
let arithm_aver = 0;
for (let e = 1; e<=500; e++ ) {
    sum+=e;
    arithm_aver = sum/500;
}
console.log('Cереднє арифметичне всіх цілих чисел від 1 до 500 =', arithm_aver);

// 4. Вивести суму лише парних чисел у діапазоні від 30 до 80
let res = 0;
for (let f = 30; f<=80; f++) {
    if (f%2===0) {
        res+=f
    }
}
console.log('Cума лише парних чисел у діапазоні від 30 до 80 =', res);

// 5. Вивести на консоль таблицю Піфагора з використанням циклів.
let row = '';
for (let g=1; g<=10; g++) {
    for (let h=1; h<=10; h++) {
        row += g * h + ' ';
    }
    console.log(row);
    row = '';
}
